//==================================================================================================================
//
// ランキング数字[rankingNum.h]
// Author : Seiya Takahashi
//
//==================================================================================================================
#ifndef _RANKINGNUM_H_
#define _RANKINGNUM_H_

//==================================================================================================================
// インクルードファイル
//==================================================================================================================
#include "main.h"
#include "scene.h"

//==================================================================================================================
// マクロ定義
//==================================================================================================================
#define RANK_NUM 5						// 最大順位
#define RANK_SCORE 6					// 最大桁数
#define NUM_POS_X 520.0f				// 数字の位置X
#define NUM_POS_Y 150.0f				// 数字の位置Y
#define TOPNUM_POS_X 520.0f				// ハイスコアの位置X
#define TOPNUM_POS_Y 680.0f				// ハイスコアの位置Y
#define NUM_INTERVAL_X 44				// 数字と数字の間の距離X
#define NUM_INTERVAL_Y 100				// 数字と数字の間の距離Y
#define NUM_SIZE_X 44					// 数字の大きさX
#define NUM_SIZE_Y 70					// 数字の大きさY

//==================================================================================================================
// 前方宣言
//==================================================================================================================
class CNumber;

//==================================================================================================================
//
// ランキング数字クラスの定義
//
//==================================================================================================================
class CRankingNum : public CScene
{
public:
	CRankingNum(PRIORITY type);						// コンストラクタ
	~CRankingNum();									// デストラクタ
	void Init(void);								// 初期化処理
	void Uninit(void);								// 終了処理
	void Update(void);								// 更新処理
	void Draw(void);								// 描画処理

	static CRankingNum *GetRank(void);				// 順位の取得
	static CRankingNum *Create(void);				// 生成処理

	void SetPos(D3DXVECTOR3 pos);					// 位置設定
	void AddRankingNum(void);						// スコア加算

protected:

private:
	static CRankingNum *m_pRankingNum;				// ランキング情報ポインタ

	CNumber *m_apNumber[RANK_NUM][RANK_SCORE];		// 数字情報のポインタ

	D3DXVECTOR3 m_pos;								// 位置

	int	m_nRanking[RANK_NUM];						// 順位
	int m_nScore;									// スコア
};
#endif